## Pandas 학습

### 라이브러리 추가

```python
!pip install pandas
```

- Successfuly installed: 최초 설치
- Requirement already satisfied: 이미 설치되어 있는 상태

In [40]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### Pandas 라이브러리 로딩
```python
import pandas as pd
```

In [41]:
import pandas as pd

### Pandas 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row): 각 하나의 유니크한 데이터 묶음
- 열(column): 유니크 데이터 하나하나의 특성

In [42]:
# 딕셔너리로 DataFrame 객체 생성 = 2차원 리스트와 동일하게 생성 가능
data = {'이름': ['홍길동', '김길동', '애슐리'], '나이': [25, 20, 40], '결혼 여부': [False, True, True]}
df = pd.DataFrame(data=data)
df

    이름  나이  결혼 여부
0  홍길동  25  False
1  김길동  20   True
2  애슐리  40   True

In [43]:
data = [['홍길동' , 25, '율도국', 'email@naver.com', False], ['김길동', 20, '부산', 'kimail@naver.com', True]
        , ['애슐리', 40, '경기', 'ashley@nate.com', True], ['홍길순', 19, '서울', 'hgs@gamil.com', False]]

data

[['홍길동', 25, '율도국', 'email@naver.com', False],
 ['김길동', 20, '부산', 'kimail@naver.com', True],
 ['애슐리', 40, '경기', 'ashley@nate.com', True],
 ['홍길순', 19, '서울', 'hgs@gamil.com', False]]

In [44]:
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소','이메일', '결혼 여부'])
df

    이름  나이   주소               이메일  결혼 여부
0  홍길동  25  율도국   email@naver.com  False
1  김길동  20   부산  kimail@naver.com   True
2  애슐리  40   경기   ashley@nate.com   True
3  홍길순  19   서울     hgs@gamil.com  False

In [45]:
#DataFrame에서 데이터 조회(열 조회) - 리스트는  for문 써야 출력 가능
df['이름']

0    홍길동
1    김길동
2    애슐리
3    홍길순
Name: 이름, dtype: object

In [46]:
#DataFrame 조회(2개 열 조회)
df[['이름', '나이']]

    이름  나이
0  홍길동  25
1  김길동  20
2  애슐리  40
3  홍길순  19

In [47]:
#데이터프레임 행으로 조회(결과 세로로 나옴)
df.loc[0]

이름                   홍길동
나이                    25
주소                   율도국
이메일      email@naver.com
결혼 여부              False
Name: 0, dtype: object

In [125]:
df.loc[[0]]

    이름  나이   주소              이메일  휴대폰
0  홍길동  25  율도국  email@naver.com  010

In [123]:
#데이터프레임 조회(행)
df.loc[[0, 1]]

    이름  나이   주소               이메일  휴대폰
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011

In [124]:
#데이터프레임 조회(행)
df.loc[0:1]

    이름  나이   주소               이메일  휴대폰
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011

In [49]:
#현재 데이터프레임 확인
df

    이름  나이   주소               이메일  결혼 여부
0  홍길동  25  율도국   email@naver.com  False
1  김길동  20   부산  kimail@naver.com   True
2  애슐리  40   경기   ashley@nate.com   True
3  홍길순  19   서울     hgs@gamil.com  False

In [50]:
#새 컬럼 추가(제일 마지막 열에 추가됨)
df['전화번호'] = ['010', '011', '017', '019']

In [51]:
#추가된 데이터프레임 확인
df

    이름  나이   주소               이메일  결혼 여부 전화번호
0  홍길동  25  율도국   email@naver.com  False  010
1  김길동  20   부산  kimail@naver.com   True  011
2  애슐리  40   경기   ashley@nate.com   True  017
3  홍길순  19   서울     hgs@gamil.com  False  019

In [52]:
#열 삭제, axis=0(행)-생략 가능 / axis=1(열)
df.drop('결혼 여부', axis=1)

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
3  홍길순  19   서울     hgs@gamil.com  019

In [53]:
df

    이름  나이   주소               이메일  결혼 여부 전화번호
0  홍길동  25  율도국   email@naver.com  False  010
1  김길동  20   부산  kimail@naver.com   True  011
2  애슐리  40   경기   ashley@nate.com   True  017
3  홍길순  19   서울     hgs@gamil.com  False  019

In [54]:
#drop(): 삭제 상태 출력만 함(저장 X), 완전 삭제 위해서는 inplace 옵션 사용
df.drop('결혼 여부', axis=1, inplace=True)  #inplace 사용 시 출력 안됨
#지운 뒤에 재실행 시 오류 뜸(∵df에 결혼 여부 없음)

In [55]:
#삭제 확인
df

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
3  홍길순  19   서울     hgs@gamil.com  019

In [56]:
#행 추가
df.loc[4] = ['손흥민', 32, '런던', 'shm@gamil.com', '020']

In [57]:
df

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
3  홍길순  19   서울     hgs@gamil.com  019
4  손흥민  32   런던     shm@gamil.com  020

In [58]:
#행 삭제, 완전 삭제를 원하면 inplace 사용 혹은 변수에 재할당
df2 = df.drop(3)

In [59]:
df2

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
2  애슐리  40   경기   ashley@nate.com  017
4  손흥민  32   런던     shm@gamil.com  020

In [60]:
#행 삭제(inplace 사용)
df.drop(2, axis=0, inplace=True)

In [61]:
df

    이름  나이   주소               이메일 전화번호
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
3  홍길순  19   서울     hgs@gamil.com  019
4  손흥민  32   런던     shm@gamil.com  020

In [62]:
#열 이름 변경
df.rename(columns={'전화번호':'휴대폰'})    #변경 내용 출력만 함
df.rename(columns={'전화번호':'휴대폰'}, inplace=True)  #변경 후 저장(출력 안함)

In [63]:
df

    이름  나이   주소               이메일  휴대폰
0  홍길동  25  율도국   email@naver.com  010
1  김길동  20   부산  kimail@naver.com  011
3  홍길순  19   서울     hgs@gamil.com  019
4  손흥민  32   런던     shm@gamil.com  020

- 데이터프레임은 파이썬의 2차원 리스트와 동일하나, 좀 더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈들을 그룹핑한 것 == 데이터프레임
- 가장 최소 단위

In [64]:
data = [47, 20, 40, 19, 32]
srs = pd.Series(data=data)
srs

0    47
1    20
2    40
3    19
4    32
dtype: int64

In [65]:
#데이터프레임의 한 열을 가지고 온 자료구조와 시리즈 동일
type(df['나이'])    #pandas.core.series.Series

pandas.core.series.Series

In [66]:
type(srs)   #pandas.core.series.Series

pandas.core.series.Series

In [67]:
srs = pd.Series(data=data, index=['성명건', '홍길동','애슐리', '홍길순', '손흥민'])
srs
#type(srs)   #pandas.core.series.Series / 인덱스만 변경했기 때문에 타입이 바뀌지는 않음

성명건    47
홍길동    20
애슐리    40
홍길순    19
손흥민    32
dtype: int64

In [68]:
#조회
srs['손흥민']

32

In [69]:
#값 변경
srs['성명건'] = 48

In [70]:
srs

성명건    48
홍길동    20
애슐리    40
홍길순    19
손흥민    32
dtype: int64

In [71]:
#데이터프레임에서 한 행을 가져와도 시리즈
df.loc[1]   #type(df.loc[1]) -> pandas.core.series.Series

이름                  김길동
나이                   20
주소                   부산
이메일    kimail@naver.com
휴대폰                 011
Name: 1, dtype: object

#### 데이터프레임 사용하기

- csv, 엑셀파일 로드
- VS Code 플러그인(확장), GrapeCity의 Excel Viewer 설치
- 엑셀 파일 로드 시 openpyxl 라이브러리를 추가 설치
    ```python
    > !pip install openpyxl
    ```

In [72]:
#CSV 로드
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8', header=1, skipfooter=2, engine='python', usecols=[0, 1, 2])
df_csv

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [73]:
#openpyxl 설치
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\dev\python312\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\dev\python312\lib\site-packages (from openpyxl) (1.1.0)

In [80]:
#엑셀 로드
df_xls = pd.read_excel('./data/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C', sheet_name='Sheet1')
df_xls

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

- 엑셀, CSV는 동일한 데이터라면 CSV가 훨씬 용량이 작음

In [81]:
# 데이터프레임(DF) 정보 확인
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [89]:
#데이터 일부 조회(위에서부터, 기본 n=5)
df_csv.head(n=3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [93]:
#데이터 일부 조회(아래에서부터, 기본 n=5)
df_csv.tail(n=3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [98]:
#통계량 요약 보기
df_csv.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [113]:
df_csv[['국적코드', '입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [108]:
#모두 다른 데이터 할당 가능
df_csv['기준년월'] = ['2023-10', '2023-11', '2023-12', '2024-01', '2024-02', '2024-03']

In [112]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-10
1  A01  여성  191436  2023-11
2  A31  남성     319  2023-12
3  A31  여성      42  2024-01
4  A18  남성  158912  2024-02
5  A18  여성  232943  2024-03

In [106]:
#하나의 데이터로 할당 가능
df_csv['기준년월'] = '2023-12'

In [115]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-10
1  A01  여성  191436  2023-11
2  A31  남성     319  2023-12
3  A31  여성      42  2024-01
4  A18  남성  158912  2024-02
5  A18  여성  232943  2024-03

In [122]:
#df_csv.loc[[0, 1, 2]]
df_csv.loc[0:2]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-10
1  A01  여성  191436  2023-11
2  A31  남성     319  2023-12

In [135]:
#필터링
condition = df_csv['국적코드'] == 'A31'
condition

0    False
1    False
2     True
3     True
4    False
5    False
Name: 국적코드, dtype: bool

In [138]:
df_csv[condition]   #국적코드가 A31 / True인 결과만 출력됨

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2023-12
3  A31  여성    42  2024-01

In [142]:
#상단의 condition 변수 만드는 부분과 사용하는 부분 합침
df_csv[df_csv['성별'] == '여성']

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2023-11
3  A31  여성      42  2024-01
5  A18  여성  232943  2024-03

In [147]:
#입국객수가 20만 이상인 데이터 행만 출력
df_csv[df_csv['입국객수'] >= 200_000]

  국적코드  성별    입국객수     기준년월
5  A18  여성  232943  2024-03

In [153]:
#여러 조건을 같이 필터링
df_csv[(df_csv['성별']=='남성') & (df_csv['입국객수'] >= 150000)]   #성별 남성, 입국객수 15만명 이상의 조건을 모두 충족하는 데이터 출력

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2024-02

In [156]:
#한 열에 여러값으로 필터링
df_csv[df_csv['국적코드'].isin(['A01', 'A31']) == True] #국적코드가 A01이거나 A31인 데이터 출력

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-10
1  A01  여성  191436  2023-11
2  A31  남성     319  2023-12
3  A31  여성      42  2024-01

In [158]:
df_csv[df_csv['국적코드'].isin(['A01', 'A31']) == False]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2024-02
5  A18  여성  232943  2024-03

In [163]:
#DF에 새 컬럼 생성
df_csv['국적명'] = ['일본', '일본', '괌', '괌', '중국', '중국']
df_csv

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2023-10  일본
1  A01  여성  191436  2023-11  일본
2  A31  남성     319  2023-12   괌
3  A31  여성      42  2024-01   괌
4  A18  남성  158912  2024-02  중국
5  A18  여성  232943  2024-03  중국

In [171]:
#DF에 인덱스 변경
df_csv = df_csv.set_index(keys = '국적명')

KeyError: "None of ['국적명'] are in the columns"

In [173]:
df_csv

    국적코드  성별    입국객수     기준년월
국적명
일본   A01  남성  106320  2023-10
일본   A01  여성  191436  2023-11
괌    A31  남성     319  2023-12
괌    A31  여성      42  2024-01
중국   A18  남성  158912  2024-02
중국   A18  여성  232943  2024-03

In [ ]:
#Grouping(그룹화)